app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"   ORDER BY created_at DESC
---
	def index
		@post=Post.all.order("created_at DESC")

INSERT INTO "posts" ("content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)
---
	def create
		@post=Post.new(post_params)
		if @post.save